In [125]:
import pandas as pd
import numpy as np

In [126]:
labels = ['a','b','c']
my_data = [10,23,45]
arr = np.array(my_data)
d = {"a":10,"b":23,"c":30}

In [127]:
arr

array([10, 23, 45])

In [128]:
pd.Series(data = my_data)

0    10
1    23
2    45
dtype: int64

In [129]:
pd.Series(data = my_data, index = labels)

a    10
b    23
c    45
dtype: int64

In [130]:
pd.Series(arr)

0    10
1    23
2    45
dtype: int32

In [131]:
pd.Series(d)

a    10
b    23
c    30
dtype: int64

In [132]:
 set1 = pd.Series([1,2,3,4],["usa","India","china","iran"])

In [133]:
set1

usa      1
India    2
china    3
iran     4
dtype: int64

In [134]:
set1['usa']

1

# Data frames

In [135]:
from numpy.random import randn
np.random.seed(101)

In [136]:
df = pd.DataFrame(randn(5,4), ["a","b","c","d","e"],["w", "x","y","Z"])

In [137]:
df

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [138]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [139]:
df["w"]['c']

-2.018168244037392

In [140]:
df['new'] = np.random.randn(5,1)

In [141]:
df

          w         x         y         Z       new
a  2.706850  0.628133  0.907969  0.503826  0.302665
b  0.651118 -0.319318 -0.848077  0.605965  1.693723
c -2.018168  0.740122  0.528813 -0.589001 -1.706086
d  0.188695 -0.758872 -0.933237  0.955057 -1.159119
e  0.190794  1.978757  2.605967  0.683509 -0.134841

In [142]:
#drop 
df.drop('new', axis=1, inplace=True)

In [143]:
df

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [144]:
df.shape

(5, 4)

In [145]:
df[["Z","x"]]

          Z         x
a  0.503826  0.628133
b  0.605965 -0.319318
c -0.589001  0.740122
d  0.955057 -0.758872
e  0.683509  1.978757

In [146]:
#seleting rows 
df.loc["a"]

w    2.706850
x    0.628133
y    0.907969
Z    0.503826
Name: a, dtype: float64

In [147]:

df.loc['b','y']

-0.8480769834036315

In [148]:
#selecting subsets 
df.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

# dataframes 2

In [149]:
booldf = df >0

In [150]:
booldf

       w      x      y      Z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [151]:
df[booldf]

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [152]:
df

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [153]:
#
df['w']>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [154]:
df[df['w']>0] # this metod will not return the rows with values less than 0 in the selected row , most important

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [155]:
resultdf = df[df['w']>0] # we will not get row  c and d because , in wth row they are with negative value

In [156]:
resultdf

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [157]:
resultdf['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [158]:
df[df['w']>0][['y',"Z"]]

          y         Z
a  0.907969  0.503826
b -0.848077  0.605965
d -0.933237  0.955057
e  2.605967  0.683509

In [159]:
#breakdown of the above line code 
boolser = df['w']>0
result = df[boolser]
mycols = ["y","Z"]
result[mycols]

          y         Z
a  0.907969  0.503826
b -0.848077  0.605965
d -0.933237  0.955057
e  2.605967  0.683509

In [160]:
# for multiple conditions 
#what if there are multiple conditions are involved 

df[(df["w"]>0) & (df['y']<0)]

          w         x         y         Z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [161]:
df

          w         x         y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [162]:
#resetting the index

In [163]:
df.reset_index()

  index         w         x         y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [164]:
#if we want it to occer , put inplace = true

In [165]:
newind = 'CA NY WY OR CO'.split()

In [166]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [167]:
df["states"] = newind

In [168]:
df

          w         x         y         Z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [169]:
#now we can set index as states 
df.set_index('states')

               w         x         y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [170]:
# imp take away .. inplace = True if we want the change to be permanent

# Dataframes 3

In [171]:
#multi level index

In [172]:
#index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [173]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [174]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [175]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [177]:
df = pd.DataFrame(randn(6,2), hier_index)

In [178]:
df

             0         1
G1 1  1.901755  0.238127
   2  1.996652 -0.993263
   3  0.196800 -1.136645
G2 1  0.000366  1.025984
   2 -0.156598 -0.031579
   3  0.649826  2.154846

In [180]:
df.loc["G1"]

          0         1
1  1.901755  0.238127
2  1.996652 -0.993263
3  0.196800 -1.136645

In [181]:
df

             0         1
G1 1  1.901755  0.238127
   2  1.996652 -0.993263
   3  0.196800 -1.136645
G2 1  0.000366  1.025984
   2 -0.156598 -0.031579
   3  0.649826  2.154846

In [184]:
df.index.names = ['Groups', "Num"]

In [185]:
df

                   0         1
Groups Num
G1     1    1.901755  0.238127
       2    1.996652 -0.993263
       3    0.196800 -1.136645
G2     1    0.000366  1.025984
       2   -0.156598 -0.031579
       3    0.649826  2.154846

In [186]:
# to grab the index from the multi index

In [187]:
df.loc["G1"]

            0         1
Num
1    1.901755  0.238127
2    1.996652 -0.993263
3    0.196800 -1.136645

In [188]:
df.xs("G1")

            0         1
Num
1    1.901755  0.238127
2    1.996652 -0.993263
3    0.196800 -1.136645